package com.china.reader.imagereader.common;

/**
 * 检测版本更新，把apk放到github上，自己配置版本升级，已有初步方案，多找几个备用方案（多注册几个github账号）
 * 搜集图片网站
 * 加密功能
 * 不让系统扫描到，只能通过这个apk打开，自动播放图片
 * 文本阅读功能，在文本中加入图片
 * 添加手机验证码功能，能否套用别人的手机验证码功能？
 * #添加注册登录功能,还没有和服务器对接？？怎么对接比较好？leancloud
 * 搭建自己的服务器，用来存放账号，图片可以直接用别人网站上的，在境外建站？php?java?用vultr搭建服务器，mysql经常自动断开连接，换一个5$或10$的服务器试一下
 * 混淆，优化代码架构，butterknife，retrofit
 * 加入友盟统计，或自己搭建服务器
 * 如何引流？1.通过qq群或微信群来推广 2.分享积分机制（需要服务器） 3.到人流密集的地方贴小广告,制作二维码贴条(先用废纸打印一些二维码)
 * 接入淘宝联盟，亚马逊，google等国内网络营销平台
 * RecycleView如何加载上面的列表？
 * 把所有的图集都保存到数据库中，把数据库导出来，把数据库上传，下载到本地再导入
 * 把ImagePage列表做成朋友圈的样式，参考《meizitu》的形式加载列表和自拍图片
 * 使用粉嫩的主题和颜色
 * 用glide加载图片，宽度适配屏幕的宽度？？
 * 添加广告平台，在查看图片的时候播放广告，可以购买会员消除广告
 * 添加广告浏览功能，在观看一定数量的广告之后可以获得免费点数
 * 添加视频广告，googlerewards广告？为什么获取不到广告
 * <p>
 * #获取图片列表
 * #收藏图片功能
 * #收藏图集功能
 * #图片浏览下载功能，浏览过的图片保存到手机中的文件夹中
 * #recycleView下拉刷新？还没想到更好的方法
 * #获取所有的url列表，保存到本地？目前实现了分页加载和预加载
 * #用ViewPager加载显示图片
 * #学习 ebmoney(http://ebmoney.win/userarea.php)的机制，他们的广告是哪里来的？亚马逊的广告 affiliate marketing
 * #支付方式？？？添加支付宝，微信等支付入口，比目？需要实名认证？1元一天，10元包月，30元包年，用服务器的时间，每次登录都判断一下
 * <p>
 * 山水桃园小区跳蚤市场项目？？
 */
public class Todo {
}
